do

function run(msg, matches)
  return [[ 
🛠 ابزارها ⚒
📆 تاریخ🔸نمایش تاریخ شمسی
⏰ زمان [کشور]🔸نمایش ساعت منطقه ای
⛱ نقشه (نام مکان)🔸نمایش نقشه یک مکان
🌥 آب و هوای (نام شهر)🔸هواشناسی شهر شما
🌍 وب [لینک]🔸اسکرین شات از صفحه سایت
🔍 گوگل [متن]🔸جستجوی گوگل
⚖ حساب [عبارت ریاضی]🔸ماشین حساب
🚩 موقعیت طول,عرض🔸نقشه طول و عرض جغرافیایی
⌛️ یادم بیار [1h2m3s] <متن>🔸یادآوری در زمان خاص
🎥 فیلم [نام انگلیسی]🔸نمایش اطلاعات یک فیلم
🕵 ویکی [متن]🔸جستجوی ویکی پدیا فارسی
📄 مقالات ویکی [عنوان]🔸نمایش لیست مقالات
📘 ترجمه انگلیسی [متن فارسی]
📗 ترجمه فارسی [متن انگلیسی و...]
🗿 بگو [متن]🔸تکرار متن توسط ربات
🎙 بخوان [متن]🔸تکرار متن توسط ربات
🎲 تاس🔸نمایش عددی از 1 تا 100
🎲 تاس [عدد] 🔸شماره تصادفی تا عدد شما
👻 عضو تصادفی🔸نمایش یکی از اعضای گروه
👶 نام تصادفی🔸نامی ایرانی همراه معنا
🗽 کشور تصادفی🔸نام و معنی یک کشور
🍭 رنگ تصادفی🔸ذکر رنگی اتفاقی
💡 سخن بزرگان🔸نمایش جمله ای ارزشمند
❕ دانستنی🔸جمله ای جالب و علمی
💬 جملات انگلیسی🔸سخنان جذاب غیرفارسی
🌇 عکس نوشته🔸تصویر پرمعنا و نوشته دار اتفاقی
🎇 عکس متحرک🔸تصویر تصادفی gif
🎇 عکس متحرک (نام لاتین)🔸جستجوی تصویر gif
📇 تبدیل [متن انگلیسی]🔸تبدیل متن به عکس
🏝 تبدیل به عکس🔸تبدیل استیکر به عکس با ریپلی
🎃 تبدیل به استیکر🔸تبدیل عکس به استیکر با ریپلی
👼 استخاره🔸فال شما در نگاه آیات
🔮 فال حافظ🔸گرفتن فال شما
🃏 فال تاروت🔸کارتی تصادفی از تاروت
💱 بارکد [متن]🔸ساخت بارکد
⛓ لینک1 [url]🔸ساخت لینک کوتاه 1
⛓ لینک2 [url]🔸ساخت لینک کوتاه 2
⛓ لینک3 [url]🔸ساخت لینک کوتاه 3
⛓ لینک4 [url]🔸ساخت لینک کوتاه 4
✍ برعکس کن [متن]🔸وارونه کردن متن شما
🏷 ای پی [ip or url]🔸نماش مشخصات ip
🎬 اپارات [متن]🔸جستجو در سایت آپارات
☀️ اوقات شرعی (نام شهر)🔸اذان، طلوع و غروب
💶  نرخ ارز🔸قیمت لحظه ای طلا، سکه و ارز
😼 گیت هاب (نام لاتین)🔸مشخصات گیت هاب
📸 اینستاگرام (نام لاتین)🔸مشخصات اینستاگرام
🏅بهترین بازیکنان فوتبال
⚽️ جدول لیگ (نام فارسی)🔸رتبه بندی تیم ها
🗓برنامه بازی های فوتبال🔸زمان بندی مسابقات
🏆نتایج بازی های فوتبال🔸نتیجه بازی ها
📝 ارسال نظر [متن پیام]🔸ارسال پیام به ادمین ربات
🔒 غیرفعال کردن ابزارها🔸جلوگیری از نمایش این پیام
]]

end

return {
  description = " bot help", 
  usage = "ابزارها",
  patterns = {
    "^(ابزارها)$"
  }, 
  run = run 
}

end
